#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-JNtLfrzrPM6VFMcY

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.api.random_password.api_secret_key_base: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"]: Refreshing state... [id=126793744]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.module.container_registries.digitalocean_container_registry.api_registry: Refreshing state... [id=foreign-language-reader]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=126793743]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.container_registries.digitalocean_container_registry_docker_credentials.api: Refreshing state... [id=foreign-language-reader]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.kubernetes_namespace.prod: Refreshing state... [id=prod]
module.infrastructure.module.content.kubernetes_namespace.content: Refreshing state... [id=content]
module.infrastructure.kubernetes_namespace.qa: Refreshing state... [id=qa]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_secret.api_secret_key_base: Refreshing state... [id=prod/api-secret-key-base]
module.infrastructure.kubernetes_ingress.foreign_language_reader_ingress: Refreshing state... [id=default/foreign-language-reader-ingress]
module.infrastructure.module.container_registries.kubernetes_secret.registry: Refreshing state... [id=default/docker-cfg]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=prod/api]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.kubernetes_ingress.foreign_language_reader_ingress will be destroyed
  - resource "kubernetes_ingress" "foreign_language_reader_ingress" {
      - id                     = "default/foreign-language-reader-ingress" -> null
      - load_balancer_ingress  = [
          - {
              - hostname = ""
              - ip       = "157.230.199.217"
            },
        ] -> null
      - wait_for_load_balancer = false -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/ingress.class"             = "nginx"
              - "nginx.ingress.kubernetes.io/enable-cors" = "true"
            } -> null
          - generation       = 2 -> null
          - labels           = {} -> null
          - name             = "foreign-language-reader-ingress" -> null
          - namespace        = "default" -> null
          - resource_version = "209683" -> null
          - self_link        = "/apis/extensions/v1beta1/namespaces/default/ingresses/foreign-language-reader-ingress" -> null
          - uid              = "4c822f54-f254-40c2-98fd-4b5fca7d0646" -> null
        }

      - spec {

          - rule {
              - host = "api.foreignlanguagereader.com" -> null

              - http {
                  - path {
                      - backend {
                          - service_name = "api" -> null
                          - service_port = "9000" -> null
                        }
                    }
                }
            }
          - rule {
              - host = "kibana.foreignlanguagereader.com" -> null

              - http {
                  - path {
                      - backend {
                          - service_name = "kibana-kibana" -> null
                          - service_port = "5601" -> null
                        }
                    }
                }
            }

          - tls {
              - hosts       = [] -> null
              - secret_name = "nginx-certificate" -> null
            }
        }
    }

  # module.infrastructure.kubernetes_ingress.prod_ingress will be created
  + resource "kubernetes_ingress" "prod_ingress" {
      + id                     = (known after apply)
      + load_balancer_ingress  = (known after apply)
      + wait_for_load_balancer = false

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors" = "true"
            }
          + generation       = (known after apply)
          + name             = "foreign-language-reader-ingress"
          + namespace        = "prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "api.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "api"
                          + service_port = "9000"
                        }
                    }
                }
            }

          + tls {
              + secret_name = "nginx-certificate"
            }
        }
    }

  # module.infrastructure.module.api.kubernetes_deployment.api is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id               = "prod/api" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 9 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ resource_version = "209489" -> (known after apply)
          ~ self_link        = "/apis/apps/v1/namespaces/prod/deployments/api" -> (known after apply)
          ~ uid              = "5cfd92b1-edcd-451b-947f-72ce5771f883" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = false -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (8 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image                      = "lkjaero/foreign-language-reader-api:1.5.5" -> "registry.digitalocean.com/foreign-language-reader-api/api:latest"
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "api"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (4 unchanged attributes hidden)

                      ~ env {
                            name = "APPLICATION_SECRET"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "application-secret"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ resources {
                          ~ limits {
                              + cpu    = (known after apply)
                                # (1 unchanged attribute hidden)
                            }

                          ~ requests {
                              + cpu    = (known after apply)
                                # (1 unchanged attribute hidden)
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                  ~ image_pull_secrets {
                      ~ name = "regcred" -> (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + quantity       = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.infrastructure.module.api.kubernetes_secret.api_secret_key_base will be destroyed
  - resource "kubernetes_secret" "api_secret_key_base" {
      - data = (sensitive value)
      - id   = "prod/api-secret-key-base" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "api-secret-key-base" -> null
          - namespace        = "prod" -> null
          - resource_version = "74573" -> null
          - self_link        = "/api/v1/namespaces/prod/secrets/api-secret-key-base" -> null
          - uid              = "03ac1b58-3681-4b0e-b0b5-4990607a404e" -> null
        }
    }

  # module.infrastructure.module.api.kubernetes_secret.application-secret will be created
  + resource "kubernetes_secret" "application-secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "application-secret"
          + namespace        = "prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.api.random_password.api_secret_key_base will be destroyed
  - resource "random_password" "api_secret_key_base" {
      - id          = "none" -> null
      - length      = 64 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = true -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.api.random_password.application_secret will be created
  + resource "random_password" "application_secret" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"] will be destroyed
  - resource "digitalocean_record" "kubernetes_subdomain_dns" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "api.foreignlanguagereader.com" -> null
      - id       = "126793743" -> null
      - name     = "api" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "157.230.199.217" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"] will be destroyed
  - resource "digitalocean_record" "kubernetes_subdomain_dns" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "kibana.foreignlanguagereader.com" -> null
      - id       = "126793744" -> null
      - name     = "kibana" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "157.230.199.217" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress will be destroyed
  - resource "helm_release" "nginx_ingress" {
      - atomic                     = false -> null
      - chart                      = "nginx-ingress" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "nginx-ingress" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "1.9.1"
              - chart       = "nginx-ingress"
              - name        = "nginx-ingress"
              - namespace   = "default"
              - revision    = 1
              - values      = "null"
              - version     = "0.7.1"
            },
        ] -> null
      - name                       = "nginx-ingress" -> null
      - namespace                  = "default" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://helm.nginx.com/stable" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "0.7.1" -> null
      - wait                       = true -> null
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be destroyed
  - resource "kubernetes_secret" "nginx_certificate" {
      - data = (sensitive value)
      - id   = "default/nginx-certificate" -> null
      - type = "kubernetes.io/tls" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "nginx-certificate" -> null
          - namespace        = "default" -> null
          - resource_version = "52859" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/nginx-certificate" -> null
          - uid              = "90d9e08c-d8de-45e9-9a19-2ed851524ef6" -> null
        }
    }

  # module.infrastructure.module.nginx_ingress_prod.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-nginx-ingress"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress_prod.digitalocean_record.kubernetes_subdomain_dns["api"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress_prod.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "nginx-ingress"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "prod"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.nginx.com/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.7.1"
      + wait                       = true
    }

  # module.infrastructure.module.nginx_ingress_prod.kubernetes_secret.nginx_certificate will be created
  + resource "kubernetes_secret" "nginx_certificate" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/tls"

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-certificate"
          + namespace        = "prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 8 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
